snappy_parallel_turb_pisoFoam_snappy_pipe/Allrun-parallel
./Allclean



cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions      # Tutorial run functions

runApplication blockMesh
decomposePar > log.meshDecomposePar
restore0Dir -processor
runParallel snappyHexMesh -overwrite

runParallel topoSet
runParallel createPatch -overwrite

reconstructParMesh -constant -mergeTol 1E-06 > log.reconstructParMesh
touch refined_pisoFoam_snappy_pipe.foam

rm -r log.pisoFoam

restore0Dir
runApplication decomposePar -force

runParallel pisoFoam

runApplication reconstructPar





